Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
    case A_LEARN4:  // learning closing way
                  if (!waittimer) {
                    // waiting for closed valve again
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) { 
                      #ifdef motDebug 
                        COMM_DBG.println("A: closed valve for learning");                  
                      #endif
                      closing_count = isr_counter;  
                      if(m_meancurrent > 0) {
                        #ifdef motDebug
                          COMM_DBG.print("A: learned mean current = "); 
                          COMM_DBG.println(m_meancurrent);
                        #endif
                        myvalvemots[valveindex].meancurrent = (myvalvemots[valveindex].meancurrent + m_meancurrent) / 2;                      
                      }                      
                                          
                      deadzone_count = closing_count - opening_count;
                      scaler = opening_count / 100;
                      #ifdef motDebug
                        COMM_DBG.print("A: learned closing_count = "); COMM_DBG.println(closing_count);
                        COMM_DBG.print("A: learned opening_count = "); COMM_DBG.println(opening_count);
                        COMM_DBG.print("A: learned deadzone_count = "); COMM_DBG.println(deadzone_count);
                        COMM_DBG.print("A: learned scaler = "); COMM_DBG.println(scaler);
                        COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(myvalvemots[valveindex].meancurrent);
                      #endif
                      myvalvemots[valveindex].closing_count = closing_count;
                      myvalvemots[valveindex].opening_count = opening_count;
                      myvalvemots[valveindex].deadzone_count = deadzone_count;
                      myvalvemots[valveindex].scaler = scaler;
                      myvalvemots[valveindex].actual_position = 0;    // because valve was closed completely  
                      COMM_DBG.print("A: counts = "); COMM_DBG.println(myvalvemots[valveindex].closing_count); 
                      COMM_DBG.println(myvalvemots[valveindex].opening_count);  
                      COMM_DBG.println(noOfMinCounts);                  
                      if ((closing_count<noOfMinCounts) || (opening_count<noOfMinCounts)) 
                      { 
                        calibRetries++;
                        myvalvemots[valveindex].calibRetries++;
                        if (calibRetries>maxCalibRetries)
                          myvalvemots[valveindex].status = VLV_STATE_BLOCKS;
                        else {
                          valvestate = A_LEARN1;
                          PSU_ON(); 
                          psuofftimer = 0;
                          waittimer = WAIT_TIMER50; 
                          COMM_DBG.print("A: calibration retry  = "); COMM_DBG.println(calibRetries); 
                          break;
                        }

                      }
                      else  myvalvemots[valveindex].status = VLV_STATE_IDLE;
                      COMM_DBG.println(myvalvemots[valveindex].status); 
                      myvalvemots[valveindex].calibration = false;
                      myvalvemots[valveindex].calibState=calibIdle;
                      valveindex = 255;                                                                                  
                      valvestate = A_IDLE;
                    }    
                    else if (temp == M_RES_NOCURRENT) {
                      #ifdef motDebug
                        COMM_DBG.println("A: (A_LEARN4) undercurrent");
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                                          
                      valveindex = 255;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }     
                    else if (temp == M_RES_ERROR) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closing valve failed, timeout");
                      #endif
                      valvestate = A_IDLE;
                      myvalvemots[valveindex].status = VLV_STATE_FAILED;
                      myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    }        
                  }           
                  break;

     case A_SET:  // set to previous %
                  myvalvemots[valveindex].actual_position=0;
                  COMM_DBG.println("A: set target A_SET");
                  valvestate = A_OPEN1;
                  PSU_ON();
                  waittimer = WAIT_TIMER50;
                  psuofftimer = 0;
                  pos_change = myvalvemots[valveindex].target_position;
                  break;
     case A_TEST:  // test if a valve is connected                  
                  if (!waittimer) {
                    
                    temp = motorcycle (valveindex, CMD_M_TEST);
                    if (temp != M_RES_TEST) {  
                      #ifdef motDebug
                        COMM_DBG.print("A: (A_TEST) test valve ");
                        COMM_DBG.print(valveindex, DEC);                  
                      #endif
                      if(temp == M_RES_NOCURRENT) {
                        #ifdef motDebug
                          COMM_DBG.println(" --> undercurrent, no valve");
                        #endif
                        myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      }
                      else {
                        #ifdef motDebug
                          COMM_DBG.println(" --> valve present");
                        #endif
                        myvalvemots[valveindex].status = VLV_STATE_PRESENT;
                      }

                      valvestate = A_IDLE;                    
                    }
                  }
                  break;

                  
    default:      valvestate = A_IDLE;
                  break;  
  }
  if (valveindex<12) myvalvemots[valveindex].connected= (myvalvemots[valveindex].status != VLV_STATE_OPENCIR);
}


byte motorcycle (int mvalvenr, byte cmd) {
  #define M_INIT      0
  #define M_IDLE      1
  #define M_OPEN      2
  #define M_CLOSE     3
  #define M_TURNING   4
  #define M_TURNON    8
  #define M_STOP      5
  #define M_STOP_ISR  6
  #define M_UNDERCURR 7
  #define M_TESTPREP  9
  #define M_TEST      10

  static byte motorstate = M_INIT;

  static int cyclecnt = 0;
  static int debouncecnt = 0;
  static int testcnt = 0;
 
